Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.абс_СпособыДоставкиКонтрагентов</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.абс_СертификатНаТовары</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.Событие</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/абс_РаботаСФайлами/Module.bsl
// Функция ЗаписатьФайлВоВнешнееХранилище
// Записывает файл в хранилище файлов
//
// Параметры:
//  СсылкаОбъекта – СправочникСсылка, ДокументСсылка – объект-владелец файла.
//  ДвоичныеДанные  – ДвоичныеДанные – данные загружаемого файла.
//  ИмяФайла - Строка - Имя загружаемого файла
//  СсылкаФайлаХранилища - СправочникСсылка.ХранилищеДополнительнойИнформации - ссылка на файл-хранилище
//
// Возвращаемое значение:
//  Структура возврата:
//		1. Успешно - признак результата вложения файла
//		2. ХранилищеСсылка - ссылка на результирующее хранилище с файлом
Функция ЗаписатьФайлВоВнешнееХранилище(СсылкаОбъекта, ДвоичныеДанные, ИмяФайла, СсылкаФайлаХранилища = Неопределено) Экспорт
	
	Если НЕ КонтрольРазмераФайла(ДвоичныеДанные) Тогда
		Возврат Новый Структура("Успешно", Ложь);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Хранилище,Успешно");
	СтруктураВозврата.Вставить("Хранилище","");
	СтруктураВозврата.Вставить("Успешно", Ложь);
	
	
	КаталогХранилищаФайлов = Константы.абс_ПутьКВнешнемуХранилищу.Получить();
	
	 Если ТипЗнч(СсылкаОбъекта) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств")   Тогда
	     КаталогХранилищаФайлов = "d:\DATA\1C_files\upp\ZRS\";
	 КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КаталогХранилищаФайлов) Тогда
		Сообщить("Не заполнен путь к каталогу хранилища файлов (меню Сервис - Настройки программы)");
		Сообщить("Файл не загружен");
		Возврат Ложь;
	КонецЕсли;
	
	НаименованиеКаталога = "";
		
	Объект = СсылкаОбъекта;
		
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		
		НаименованиеКаталога = НаименованиеКаталога + "\Прочие файлы";
		
	Иначе
				
		НаименованиеКаталога = НаименованиеКаталога + Строка(Объект.Метаданные().Имя) + "\";
		
		Если НЕ Справочники.ТипВсеСсылки().Типы().Найти(ТипЗнч(Объект)) = Неопределено Тогда
		НаименованиеКаталога = НаименованиеКаталога + "\" + 
			РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(
				СокрЛП(Объект.Код) + "_" +
				Строка(Объект.УникальныйИдентификатор()));
			
		Иначе
			НаименованиеКаталога = НаименованиеКаталога + "\" + 
			РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(
			СокрЛП(Объект.Номер) + "_" +
			Строка(Объект.УникальныйИдентификатор()));
			
		КонецЕсли;
			
	КонецЕсли;
		
	Попытка 
		ПутьКФайлу = КаталогХранилищаФайлов + "\" + НаименованиеКаталога;
		
		СоздатьКаталог(ПутьКФайлу);
				
		Файл = Новый Файл(ПутьКФайлу + "\" + ИмяФайла);
		
		ИмяФайла 	= Файл.ИмяБезРасширения;
		Расширение 	= Файл.Расширение;
		
		ПолныйПутьКФайлу = ПутьКФайлу + "\" + РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла + Расширение);
				
		Пока Файл.Существует() Цикл
			ПолныйПутьКФайлу = ПутьКФайлу + "\" + РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяФайла + "_" + Строка(Новый УникальныйИдентификатор) + Расширение);
			Файл = Новый Файл(ПолныйПутьКФайлу);
		КонецЦикла;
		
		СтруктураВозврата.Вставить("Хранилище",Прав(ПолныйПутьКФайлу, СтрДлина(ПолныйПутьКФайлу) - СтрДлина(КаталогХранилищаФайлов)));
		ДвоичныеДанные.Записать(ПолныйПутьКФайлу);
		
		Если НЕ СсылкаФайлаХранилища = Неопределено Тогда			
			ОбъектХранилища = СсылкаФайлаХранилища.ПолучитьОбъект();
		Иначе			
			ОбъектХранилища = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
			ОбъектХранилища.Объект 			= СсылкаОбъекта;
			ОбъектХранилища.ИмяФайла 		= ИмяФайла;
			ОбъектХранилища.ВидДанных 		= Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		КонецЕсли;
		
		ОбъектХранилища.Хранилище = Новый ХранилищеЗначения(Прав(ПолныйПутьКФайлу, СтрДлина(ПолныйПутьКФайлу) - СтрДлина(КаталогХранилищаФайлов)));
		ОбъектХранилища.Наименование = ИмяФайла;
		ОбъектХранилища.абс_ИмяФайла = Файл.ПолноеИмя;
		ОбъектХранилища.абс_ДатаПрикрепленияФайла = ТекущаяДата();
		ОбъектХранилища.абс_ИнициаторФайла = глЗначениеПеременной("глТекущийПользователь");
		
		ОбъектХранилища.Записать();
		
	Исключение
		ОбщегоНазначенияЗК.СообщитьОбОшибке("Ошибка загрузки файлов: " + ОписаниеОшибки());
		СтруктураВозврата.Вставить("Успешно",Ложь);
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	СтруктураВозврата.Вставить("ХранилищеСсылка", ОбъектХранилища.Ссылка);
	СтруктураВозврата.Вставить("Успешно",Истина);
	Возврат СтруктураВозврата;	
	
КонецФункции

// Функция ПолучитьФайлИзВнешнегоХранилища
// Получает файл из хранилище файлов
//
// Параметры:
//  СсылкаФайла – СправочникСсылка.ХранилищеДополнительнойИнформации - ссылка на файл, 
//				который необходимо получить из хранилища.
//
// Возвращаемое значение:
//  Двоичные данные, полученные по ссылке на файл-хранилище
Функция ПолучитьФайлИзВнешнегоХранилища(СсылкаФайла) Экспорт
	                             
	Если ТипЗнч(СсылкаФайла.Хранилище.Получить()) = Тип("Строка") Тогда
		 ПутьКФайлу = Константы.абс_ПутьКВнешнемуХранилищу.Получить() + "/" + СсылкаФайла.Хранилище.Получить();
		 
	 Если ТипЗнч(СсылкаФайла.Объект) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств")   Тогда
	     ПутьКФайлу = "d:\DATA\1C_files\upp\ZRS\" + "/" + СсылкаФайла.Хранилище.Получить();
	 КонецЕсли;
		 Возврат Новый ДвоичныеДанные(ПутьКФайлу);
	КонецЕсли;		

КонецФункции

// Функция КонтрольРазмераФайла
// Проверяет размер файла на ограничение, указанное в настройках системы
//
// Параметры:
//  ДвоичныеДанные – ДвоичныеДанные - Двиочные данные файла
//
// Возвращаемое значение:
//  Результат проверки файла, Истина - контроль пройден, Ложь - контроль не пройден.
Функция КонтрольРазмераФайла(ДвоичныеДанные)
	
	МаксимальныйРазмерФайлаМБ = Константы.абс_МаксимальныйРазмерФайла.Получить();
	
	Если НЕ ЗначениеЗаполнено(МаксимальныйРазмерФайлаМБ) Тогда
		Возврат Истина;
	КонецЕсли;
	
	РазмерФайлаБайтыМБ = Окр(ДвоичныеДанные.Размер() / 1024 / 1024, 3);
	
	Если РазмерФайлаБайтыМБ > МаксимальныйРазмерФайлаМБ Тогда
		ОбщегоНазначенияЗК.СообщитьОбОшибке("Превышен максимальный размер прикрепляемого файла.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьТабличныйДокументПоФайлуExcel(ПутьКФайлуВХранилище) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьКФайлуВХранилище);
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
	ДвоичныеДанные.Записать(ПутьКФайлу);	
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось открыть файл. ", ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ТабДок = Новый ТабличныйДокумент;
	
	//рассчитаем количество колонок по шапке
	//считаем что шапка состоит из двух строк
	ТекущаяКолонка = 1;
	
	ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
	ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	
	Пока ЗначениеЗаполнено(ТекущееЗначение1) или ЗначениеЗаполнено(ТекущееЗначение2) Цикл
		ТабДок.Область(1, ТекущаяКолонка, 1, ТекущаяКолонка).Текст = ТекущееЗначение1;
		ТабДок.Область(2, ТекущаяКолонка, 2, ТекущаяКолонка).Текст = ТекущееЗначение2;
		ТекущаяКолонка = ТекущаяКолонка + 1;
		ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
		ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	КонецЦикла;
	
	КоличествоКолонок = ТекущаяКолонка - 1;
	
	ТекущаяСтрока = 3;
	ТекущаяКолонка = 1;
	ТекущееЗначение 		= СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
	ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
						   
	Пока ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ЗначениеЗаполнено(ТекущееЗначениеПроверка) Цикл
		
		Пока ТекущаяКолонка<=КоличествоКолонок Цикл
			
			ТабДок.Область(ТекущаяСтрока, ТекущаяКолонка, ТекущаяСтрока, ТекущаяКолонка).Текст = ТекущееЗначение;
			
			ТекущаяКолонка = ТекущаяКолонка + 1;
			
			ТекущееЗначение 		= СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
			ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
		КонецЦикла;
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
		ТекущаяКолонка = 1; 
		ТекущееЗначение = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
		ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
		
	КонецЦикла;
	
	Excel.Quit();
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьТабличныйДокументПоФайлуExcel_Леовит(ПутьКФайлуВХранилище) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПутьКФайлуВХранилище);
	ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
	ДвоичныеДанные.Записать(ПутьКФайлу);	
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ПутьКФайлу);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке("Не удалось открыть файл. ", ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	ТабДок = Новый ТабличныйДокумент;
	
	//рассчитаем количество колонок по шапке
	//считаем что шапка состоит из двух строк
	//ТекущаяКолонка = 1;
	//
	//ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
	//ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	
	//Пока ЗначениеЗаполнено(ТекущееЗначение1) или ЗначениеЗаполнено(ТекущееЗначение2) Цикл
	//	ТабДок.Область(1, ТекущаяКолонка, 1, ТекущаяКолонка).Текст = ТекущееЗначение1;
	//	ТабДок.Область(2, ТекущаяКолонка, 2, ТекущаяКолонка).Текст = ТекущееЗначение2;
	//	ТекущаяКолонка = ТекущаяКолонка + 1;
	//	ТекущееЗначение1 = СокрЛП(ExcelЛист.Cells(1, ТекущаяКолонка).Value);
	//	ТекущееЗначение2 = СокрЛП(ExcelЛист.Cells(2, ТекущаяКолонка).Value);
	//КонецЦикла;
	//
	//КоличествоКолонок = ТекущаяКолонка - 1;
	//
	//ТекущаяСтрока = 3;
	//ТекущаяКолонка = 1;
	//ТекущееЗначение 		= СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
	//ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
	
	//Никитин
	КоличествоСтрок = ExcelЛист.Cells(1,1).SpecialCells(11).Row;
    КоличествоКолонок = ExcelЛист.Cells(1,1).SpecialCells(11).Column;
	ТекущаяСтрока = 1;
	ТекущаяКолонка = 1;

	
	
	Пока ТекущаяСтрока<=КоличествоСтрок Цикл

	//Пока ЗначениеЗаполнено(ТекущееЗначение) ИЛИ ЗначениеЗаполнено(ТекущееЗначениеПроверка) Цикл
		
		Пока ТекущаяКолонка<=КоличествоКолонок Цикл
			
			ТабДок.Область(ТекущаяСтрока, ТекущаяКолонка, ТекущаяСтрока, ТекущаяКолонка).Текст = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
			ТекущаяКолонка = ТекущаяКолонка + 1;
			
			//ТекущееЗначение 		= СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
			//ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
		КонецЦикла;
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
		ТекущаяКолонка = 1; 
		//ТекущееЗначение = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, ТекущаяКолонка).Value);
		//ТекущееЗначениеПроверка = СокрЛП(ExcelЛист.Cells(ТекущаяСтрока, 2).Value);
		
	КонецЦикла;
	
	Excel.Quit();
	
	Возврат ТабДок;
	
КонецФункции



Функция УбратьПервыйАпостроф(Стр) Экспорт
	
	Если СтрДлина(Стр)>0 Тогда
		Если Лев(Стр,1) = "'" Тогда
			Стр = Прав(Стр,СтрДлина(Стр)-1);
		КонецЕсли;
		Возврат Стр;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
